app/controllers/abouts_controller.rb

    def index
render json: About.all
---
SELECT `abouts`.* FROM `abouts`