app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories`
---
    def index
        render json: Category.all,status: :ok

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 70 LIMIT 1
---
    def show
        category = Category.find(params[:id])