app/controllers/events_controller.rb

    def find_event
        Event.find(params[:id])
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 23 LIMIT 1