app/controllers/events_controller.rb

SELECT `events`.* FROM `events`
---
    def index
    render json: Event.all,status: :ok

INSERT INTO `events` (`category_id`, `title`, `event_date`, `early_booking_end_date`, `early_booking_price_regular`, `early_booking_price_vip`, `location`, `regular_price`, `vip_price`, `vip_no_of_tickets`, `regular_no_of_tickets`, `banner_img`, `description`, `image_url1`, `image_url2`, `created_at`, `updated_at`) VALUES (1, 'Afrika Concert', '2022-12-12 10:00:00', '2022-11-19 00:00:00', 1200, 2000, 'afraha stadium Nakuru', 1500, 2300, 1000, 4000, 'https://img.freepik.com/free-vector/beautiful-music-sound-golden-notes-background_1017-32310.jpg?w=2000', 'Enjoy our african diverse culture.', 'https://c8.alamy.com/comp/2EGH5DT/live-music-concert-sketch-poster-with-musical-instruments-vector-design-of-musical-button-accordion-folk-bandura-and-rebec-viola-african-jembe-drum-2EGH5DT.jpg', 'https://previews.123rf.com/images/vasilyrosca/vasilyrosca1702/vasilyrosca170200423/71501970-neon-live-music-concert-acoustic-party-poster-background-template-with-spotlight-and-stage-.jpg', '2022-10-24 05:23:47.926316', '2022-10-24 05:23:47.926316')
---
    def create
        event = Event.create!(event_params)

UPDATE `events` SET `events`.`regular_price` = 1600, `events`.`vip_price` = 2400, `events`.`updated_at` = '2022-10-24 05:56:12.208371' WHERE `events`.`id` = 1
---
    def update
        event = find_event
        event.update!(event_params)

DELETE FROM `events` WHERE `events`.`id` = 7
---
    def destroy
        event = find_event
        event.destroy

SELECT `events`.* FROM `events` WHERE `events`.`id` = 7 LIMIT 1
---
    def find_event
        Event.find(params[:id])