app/controllers/sessions_controller.rb

    def create
        # byebug
        # This line shall find a user in the users table if they tender a valid username
        user = User.find_by(username: params[:username])
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'resbon' LIMIT 1