app/controllers/tickets_controller.rb

SELECT `tickets`.* FROM `tickets`
---
    def index
        render json: Ticket.all, status: :ok

INSERT INTO `tickets` (`ticket_no`, `user_id`, `event_id`, `is_vip`, `number_of_vip_tickets`, `is_regular`, `number_of_regular_tickets`, `created_at`, `updated_at`) VALUES ('MusAfri001', 1, 1, TRUE, 1, TRUE, 1, '2022-10-26 01:14:34.325094', '2022-10-26 01:14:34.325094')
---
    def create
        ticket = Ticket.create!(ticket_params)

UPDATE `tickets` SET `tickets`.`is_regular` = FALSE, `tickets`.`number_of_regular_tickets` = 0, `tickets`.`updated_at` = '2022-10-26 01:16:29.562711' WHERE `tickets`.`id` = 16
---
    def update
        ticket = find_ticket
        ticket.update(ticket_updateparams)

DELETE FROM `tickets` WHERE `tickets`.`id` = 17
---
    def destroy
        ticket = find_ticket
        ticket.destroy

SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 17 LIMIT 1
---
    def find_ticket
        Ticket.find(params[:id])