app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
    def index
        user = User.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def show
        user = User.find_by(id: session[:user_id])

INSERT INTO `users` (`email`, `username`, `password_digest`, `is_organiser`, `created_at`, `updated_at`) VALUES ('papa@test.com', 'papa', '$2a$12$Ctkv/zJbTlXCbMX35eXwgu4gAJ/BdP47ZENgEMcMO77DKh7x5nn0.', FALSE, '2022-10-23 08:28:25.526580', '2022-10-23 08:28:25.526580')
---
    def create
        user = User.create!(user_params)