app/controllers/user_profiles_controller.rb

SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`id` = 2 LIMIT 1
---
    def find_profile
        UserProfile.find(params[:id])